prompt_template = '''Використай наведений контекст для відповіді на питання.

Контекст:
%s

Питання: %s

Варіанти відповідей:
%s

Якщо відповідь міститься в контексті, дай відповідь лише літерою правильного варіанту (лише одна літера — A, B, C, D або E).
Якщо контекст не містить відповіді, обери найбільш вірогідний варіант.

Відповідь: '''

prompt_template_yes_no = '''Текст:
<<<
%s
>>>

Твердження: %s %s

Чи підтверджується твердження текстом? Відповідай одним словом: "так" або "ні". Не пояснюй чому.

Відповідь:'''

prompt_template_no_retriever = '''Питання: %s

Варіанти відповідей:
%s

Дай відповідь лише літерою правильного варіанту.
Відповідь: '''
